app/Controllers/Crud.php

    public function index(): string
    {
        $data['mahasiswa'] = $this->mahasiswa->findAll();
---
SELECT *
FROM `tb_mahasiswa`

    public function edit($nim = null): RedirectResponse|string
    {
        if ($nim === null) {
            session()->setFlashdata(data: 'error', value: 'NIM tidak ditemukan.');
            return redirect()->to(uri: '/crud');
        }
        $mahasiswaData = $this->mahasiswa->find(id: $nim);
---
SELECT *
FROM `tb_mahasiswa`
WHERE `tb_mahasiswa`.`nim` = '32602300072'